## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 9 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.neo4j_to_sentinel will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "neo4j_to_sentinel"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "/tmp/neo4j_to_sentinel.py.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "src/sentinel_ingestor/dist"
      + type                = "zip"
    }

  # aws_cloudwatch_log_group.neo4j_to_sentinel will be created
  + resource "aws_cloudwatch_log_group" "neo4j_to_sentinel" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/sentinel-neo4j-forwarder"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.neo4j_to_sentinel_lambda will be created
  + resource "aws_iam_policy" "neo4j_to_sentinel_lambda" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Neo4JLambdaSentinelIngestorLambdaRolePolicy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:PassRole",
                          + "iam:GetRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          + "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.neo4j_to_sentinel_lambda will be created
  + resource "aws_iam_role" "neo4j_to_sentinel_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ecs-tasks.amazonaws.com",
                              + "lambda.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Neo4JLambdaSentinelIngestor"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.neo4j_to_sentinel_lambda will be created
  + resource "aws_iam_role_policy_attachment" "neo4j_to_sentinel_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "Neo4JLambdaSentinelIngestor"
    }

  # aws_iam_role_policy_attachment.neo4j_to_sentinel_lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "neo4j_to_sentinel_lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "Neo4JLambdaSentinelIngestor"
    }

  # aws_iam_role_policy_attachment.neo4j_to_sentinel_lambda_vpc_service_role will be created
  + resource "aws_iam_role_policy_attachment" "neo4j_to_sentinel_lambda_vpc_service_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "Neo4JLambdaSentinelIngestor"
    }

  # aws_iam_role_policy_attachment.neo4j_to_sentinel_lambda_xray_write will be created
  + resource "aws_iam_role_policy_attachment" "neo4j_to_sentinel_lambda_xray_write" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess"
      + role       = "Neo4JLambdaSentinelIngestor"
    }

  # aws_lambda_function.neo4j_to_sentinel will be created
  + resource "aws_lambda_function" "neo4j_to_sentinel" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/neo4j_to_sentinel.py.zip"
      + function_name                  = "sentinel-neo4j-forwarder"
      + handler                        = "neo4j_to_sentinel.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:6",
        ]
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CUSTOMER_ID"            = (sensitive)
              + "LOG_TYPE"               = "CartographyTest"
              + "NEO4J_SECRETS_PASSWORD" = (sensitive)
              + "NEO4J_URI"              = "bolt://neo4j.internal.local:7687"
              + "NEO4J_USER"             = "neo4j"
              + "SHARED_KEY"             = (sensitive)
            }
        }

      + tracing_config {
          + mode = "Active"
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-03caf974f268a3efb",
            ]
          + subnet_ids         = [
              + "subnet-07f8e17bbf11b0797",
              + "subnet-08cab5daf34489c53",
              + "subnet-0d92713028fd15243",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # null_resource.lambda_build will be created
  + resource "null_resource" "lambda_build" {
      + id       = (known after apply)
      + triggers = {
          + "build"         = "eM/YjFJIxvExGEkWqpEDHYAx63+pgeYvO/BG8orWh2Q="
          + "connector"     = "0fdd+SgWcdDNqzRuvkuVPO+Qirw51wBgKBlzdIlV7a0="
          + "handler"       = "vRLYrIz+ioTFt/mvOaCwkShP5NmmLtkq8obdCiLPQ9U="
          + "neo4j_queries" = "UscW9Td/9NGF3dHyaE9vaBbhU6O/eC3aZoTbst8TdvM="
          + "requirements"  = "ao2rXazjWkpz/Q8gS9IjBlbKTX7g7mWTmgjcQBy27Rw="
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
